      
       IDENTIFICATION DIVISION.
           PROGRAM-ID. BASECOB.
       ENVIRONMENT DIVISION.
           
      * CONFIGURATION SECTION
      * INPUT-OUTPUT SECTION
       DATA DIVISION.
      * FILE SECTION
      * WORKING-STORAGE SECTION
      * LOCAL-STORAGE SECTION
      * LINKAGE SECTION
       PROCEDURE DIVISION.